[
 {
   "LanguageCode": "en",
   "Text": "While I enjoyed the Lynda videos and found them helpful, I didnt like how he relied on them in the beginning of the semester. However,\nas the semester went on her moved farther away from that and instructed more hands on examples, which worked better."
 },
 {
   "LanguageCode": "en",
   "Text": "The class could benefit from be harder(especially the quizzes) as everyone in the class has a strong interest in php and is most likely pretty good at it."
 },
 {
   "LanguageCode": "en",
   "Text": "Homework, course-long project"
 },
 {
   "LanguageCode": "en",
   "Text": "I would make the final project the final grade instead of a final exam, and I would attribute more time to it. I would introduce it early and have check-ins or something and make it similar to the MIS capstone project. I spent so much time on my final project and now I dont\nwant to step back and relearn Cakephp"
 },
 {
   "LanguageCode": "en",
   "Text": "I would have liked for more hands on programming during the course."
 },
 {
   "LanguageCode": "en",
   "Text": "More in-class exercises and examples"
 },
 {
   "LanguageCode": "en",
   "Text": "His curriculum to make a app helped me learning the course."
 },
 {
   "LanguageCode": "en",
   "Text": "Intel XDK is too glitchy and doesnt provide native look and feel. I would replace it with Ionic or Framwork7 frameworks."
 },
 {
   "LanguageCode": "en",
   "Text": "More challenge assignments to be done independently as we went along and learned new material. The in class exercises were\nhelpful, but the solo challenges in 3501 were what really made me feel like I understood how to use/do whatever we were learning about."
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "I think it would have been helpful to spend more time on Intel XDK because its a really cool tool, but can be challenging to use."
 },
 {
   "LanguageCode": "en",
   "Text": "None."
 },
 {
   "LanguageCode": "en",
   "Text": "get rid of XDK"
 },
 {
   "LanguageCode": "en",
   "Text": "More challenges"
 },
 {
   "LanguageCode": "en",
   "Text": "The class is barely more than quick demos for very straight forward use cases. Sometimes things are demoed that arent best practices.\nThere is no focus on problem solving or logical thinking. He adds questions to tests and quizzes based on what he assumes to be correct, or in reference to something specific he taught in class, but they are in fact wrong or arent completely correct. The course does\nvery little to teach students about programming. There are little to no high level concepts in 3501 or 3502. Important things like classes,\nobjects and data structures are completely ignored. 3502 just barely covered composing functions, nothing about regular expressions,\nsomething that is useful in everyday life with Microsoft Office and the command prompt. I really question how effective someone can go on to become as a programmer if this is their base of knowledge. It doesnt even teach JavaScript! Ask any of the students about\nprototypal inheritance, the event loop, scope, using the this keyword, anything other than basic jQuery. Freecodecamp.com could train\nstudents in web development (and programming at large) much, much better and for free. Students should feel nothing other than\ncheated."
 },
 {
   "LanguageCode": "en",
   "Text": "being graded by a group of judges that have no knowledge of the course work or objectives of the class. I have never seen grading that has been that unfair in my entire Temple career"
 },
 {
   "LanguageCode": "en",
   "Text": "Nothing."
 },
 {
   "LanguageCode": "en",
   "Text": "Less time recapping PHP 1, give a lot more time spent on Javascript and JQuery. Maybe make the project individual because\nteammates didnt pull their weight."
 },
 {
   "LanguageCode": "en",
   "Text": "Exams shouldnt weighted so much, maybe do Half the project and half the exams."
 },
 {
   "LanguageCode": "en",
   "Text": "Hes a nice professor, but he should ease up on his grading policies a little bit."
 },
 {
   "LanguageCode": "en",
   "Text": "more content, make the course harder"
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "More extra simple exercise to practice coding skill"
 },
 {
   "LanguageCode": "en",
   "Text": "I have ideas, too much to write in here."
 },
 {
   "LanguageCode": "en",
   "Text": "a"
 },
 {
   "LanguageCode": "en",
   "Text": "This course has way too much involved. The deadlines for the project along with the class schedule for learning, homework challenges, and exams makes it near impossible to complete everything. It was way, way too much work, especially given our previous knowledge on the topic. I do not think this course was structured or taught well at all."
 },
 {
   "LanguageCode": "en",
   "Text": "introduction of git or version management technology/system may enhance the efficiency of the course project"
 },
 {
   "LanguageCode": "en",
   "Text": "Not sure"
 },
 {
   "LanguageCode": "en",
   "Text": "The project is tailored to students who have made an application before, or have seen one constructed. The groups are very make or break it for your grade. Those who do not have any experience in application development are given not much help."
 },
 {
   "LanguageCode": "en",
   "Text": "His grading for the project is very scattered and nonsensical. It seems to punish effective solutions if they dont conform to his idea of\nwhat it should look like while providing good grades for lesser challenges because they meet his narrow criteria of how the solution\nshould be shaped. His deadlines are also all over the place with constantly changing due dates. His grading time is also too long.\nDeliverable #3 was not returned until less than 3 days before the next one, meaning that any adjustments required based on his\nfeedback required a rush job. In addition I have seen and heard of multiple instances in which Shafer does coding for the project for\nstudents, negating their learning and rewarding students who cannot solve their issues. The main problems lie, obviously, with the\nproject and the uneven and vague way that Professor Shafer decides to grade."
 },
 {
   "LanguageCode": "en",
   "Text": "Less difficult project."
 },
 {
   "LanguageCode": "en",
   "Text": "I felt that having so many exams on top of a semester long project was a lot to handle at times. However, I did like the written exam\nformat more than the computer exams we had in 3501."
 },
 {
   "LanguageCode": "en",
   "Text": "N/A"
 },
 {
   "LanguageCode": "en",
   "Text": "I would recommend professor to help form the teams at the beginning of semester."
 },
 {
   "LanguageCode": "en",
   "Text": "This course has an over abundance of material. MIS is an area where some people are incredibly talented coders, and others are only\ninterested enough to understand and be successful in this industry. Therefore, this class is entirely too advanced for non-coders. This\nshould be an MIS elective. Professor Shafer did a great job teaching this class, but it was clearly too challenging for many students.\nThe amount of material covered is unrealistic from a new coders perspective. Im not sure if there is anything the professor can change,\nother than condensing the amount of material covered."
 },
 {
   "LanguageCode": "en",
   "Text": "This course should immediately follow the prerequisite (3501) as much of ones previous knowledge is otherwise easily forgotten (3501\nin the fall and 3502 in the spring). We moved very quickly with little review in the beginning and even seemed to race through new\ntopics that make up the meat of the course. Some of the larger concepts were easy enough to understand on a high level, but the same\nclarity did not apply when digging deeper. And there seemed to be some inconsistency with the application of the code from the\nlectures to the challenges to the project. Also, some project teams were unbalanced, although I cant say that assigning teams would\nnecessarily be a better solution than self-picked ones. The project was quite large, VERY hard to split up amongst the varying talent\nlevels, and trying to collaborate was a logistical nightmare. Lastly, the book was overwhelming, covering way more than the class did\nand seemingly written for someone more experienced - I stopped using it after one or two readings."
 },
 {
   "LanguageCode": "en",
   "Text": "Fair grading, less tests or less time-consuming project. Having the amount of tests we did on top of such an intensive project was\nunrealistic. Would be fine if we werent taking 4-6 other classes. Also, do not have project deliverables and tests due on or around the\nsame time. Makes it so you have to choose one to be successful with."
 },
 {
   "LanguageCode": "en",
   "Text": "Since this course is now required for all MIS majors, not everyone is good/likes to code. So I would say to do multiple examples with\nnew languages like JavaScript, jQuery, and bootstrap to help learn the material better"
 },
 {
   "LanguageCode": "en",
   "Text": "0s were given for group project deliverables that were handed in. To me, a 0 means that there was no submission."
 },
 {
   "LanguageCode": "en",
   "Text": "More availability in office hours, better communication with emails, not packing more than able to teach into one class (things being taught too quickly to comprehend)"
 },
 {
   "LanguageCode": "en",
   "Text": "More project labs, before each deliverable, was due instead of all at the end"
 },
 {
   "LanguageCode": "en",
   "Text": "I would recommend it be taken immediately following 3501; I spent a significant amount of time reviewing and relearning skills I had\npreviously had from that class which I hadnt used much of in the six months since taking it."
 },
 {
   "LanguageCode": "en",
   "Text": "I did not enjoy taking the exams on paper. In the first section of this class (Data Centric Application Development) we actually coded for\nthe exams. I would have preferred that. The paper exams were not conducive to my understanding of coding."
 },
 {
   "LanguageCode": "en",
   "Text": "I would appreciate if Shafer could publish his slide decks a few days before the exam"
 },
 {
   "LanguageCode": "en",
   "Text": "To me, it seemed that the other section (002) had an easier project deliverable than my section did (001). While this is fine, I would\nhope when the final grading begins this is taken into account."
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "I thought the showcase for each assignment was a cool idea because it mirrors a developers walk-through after unit coding, but I dont\nthink the students were prepared for it. With the amount of work needed for the project, I dont think Professor Shafer can have both a\nwell-done project and weekly assignments. I wish class assignments were not weighted so heavily for the same reason. Maybe instead,\nstudents could demo one piece of their project code as it relates to course concepts. Also, students should receive points for\nattendance since Professor Shafer posts his lectures online. Maybe use the AIS app if taking attendance is unmanageable."
 },
 {
   "LanguageCode": "en",
   "Text": "1) Department wise, 3501 students should be told to take this course right after. It had been a year since I had 3501, and it made it\ndifficult on me that the class expected us to remember everything from php. Inform students to take 3502 after 3501. 2) Many\nclassmates complained that the email response rate was lacking. If I were the professor, I would create an email that the TA and\nprofessor share. That way if the professor is too busy to help (I understand theres a lot of students he takes on), the TA (under utilized,\nmany people didnt even know our TA) could help. Like a help desk for coding problems."
 },
 {
   "LanguageCode": "en",
   "Text": "He should explain more about how to use Session"
 },
 {
   "LanguageCode": "en",
   "Text": "Because the exams are strictly memorization, i do not feel that I learned how to code in Javascript or have a deeper understanding of\nPHP. the 3501 exams forced me to learn how to code and troubleshoot errors. At no point in my career will I have to write out code on a\npiece of paper, so i think that was a poor decision to make students do this for a class. The final should be given during finals week. It\nmade no sense that a cumulative exam is given during non-cumulative finals week especially since this is AGAINST SCHOOL POLICY.\nTaken directly from the schools website: During Fall and Spring semesters, final examinations may not be scheduled in the last week of\nclasses, or on study days.I do not understand why this was not implemented for our class. lastly, it was not helpful to have students\nshow their work instead of Shafer showing challenge solutions, because it made it harder for students to see good examples and\nunderstand the challenges."
 },
 {
   "LanguageCode": "en",
   "Text": "I was appreciative the exams were different than MIS3501 and the challenge reviews were great, however, more coding examples\nsimilar to the challenges prior to working on them offline would have been beneficial. Maybe the two class /week schedule with just about an hour and half doesnt allow the appropriate amount of time to cover both the slides and examples.. I get it....."
 },
 {
   "LanguageCode": "en",
   "Text": "I would completely re-design the course curriculum. The course is teaching highly outdated technologies that are not being used in real\nworld. Also, because of their outdatedness, these technologies are difficult to work with(like Netbeans and not GitHub!!). This course really limits the ability of MIS majors to understand(and get fascinated by a career in) web development and how it is done in the real\nworld, not the early 2000s or a corporate setting. Also, tech like jquery should not be taught formally and students should be forced to\nfind solutions for themselves and understand it through google(as that is imp skill). I am experienced so I did not have many issues, but\nmy friends really didnt understand the big picture of web dev after taking this course. I believe, and there should be no written exams as that does not make sense in a hands on coding class. I felt that I learned alot more in 3501 about web. I believe the best tech stack to\nuse for this class- Node.js(server side instead of PHP or Python as proposed in 3501) becuase of its extensive libraries and javascript based interface, A front end JavaScript framework like Vue.js(easy for beginners) or React, and NoSQL database like MongoDB(as\nMIS 2502&3502 both use SQL) . I feel incompetent when I go to hackathons and try to build simple applications, because what Im\nbeing taught in school is used by NOBODY in my age-group to develop web apps(which is the main objective of the course). I feel like\nafter taking 2 classes in web development I would be learning the best tools but this sequence of courses has been a huge\ndisappointment as an MIS major, and I regret choosing this major because of these 2 classes. I had choosen this as my major when I\nhad entered because it claimed to teach cutting-edge technologies, but I feel like my understanding and enthusiasm regarding coding has degraded by using these OUTDATED technologies. As a result, I have to spend alot of additional time learning to code and build\nprojects using modern tech because they are more engaging. The course does require alot of work in terms of the final project, and I\nthink the final project is also a very bad idea as students dont get enough guidance regarding the deliverables, and there is a strict\nstructure that is required to be followed in order to get good marks, thus killing the creativity that students can use to develop their app and understand web development IN REAL LIFE. I believe that every as MIS professor should re-design their curriculum to reflect\nmodern software/web development practices. VERY BAD sequence of courses, also it makes no sense to take 3501 in\nsophomore/junior and this in junior/senior, they should be taken consecutively. -Naved"
 },
 {
   "LanguageCode": "en",
   "Text": "The group assignment was difficult especially since teams were somewhat assigned, communication was difficult between some\nmembers"
 },
 {
   "LanguageCode": "en",
   "Text": "Maybe have more time to learn certain languages before going in depth so fast."
 },
 {
   "LanguageCode": "en",
   "Text": "coding skill will help in our future career."
 },
 {
   "LanguageCode": "en",
   "Text": "Nothing."
 },
 {
   "LanguageCode": "en",
   "Text": "Structure of the course should work similar to MIS 3506. Final project should be graded on final product. Each deliverable should still\ncount as grade, but not towards the final project grade."
 },
 {
   "LanguageCode": "en",
   "Text": "This class compared to 3501 was pretty disappointing. In the first level class (3501) we learned in a more real world setting and the\nexams reflected that. In this course, the exams are mainly based on arbitrary concepts that we would not actually need to know as a\nprogrammer. Hand writing code is a ridiculous concept that we would never actually need to do in real life, and doesnt prove anything\nexcept the ability to memorize."
 },
 {
   "LanguageCode": "en",
   "Text": "more specific study guides/tips"
 },
 {
   "LanguageCode": "en",
   "Text": "Nothing."
 },
 {
   "LanguageCode": "en",
   "Text": "Nothing :)"
 },
 {
   "LanguageCode": "en",
   "Text": "Projects ask for a lot of work. Sometimes it becomes difficult because the instructions are not very clear."
 },
 {
   "LanguageCode": "en",
   "Text": "i dont think he teaches the course well. its a programming class - very hands on in nature. i feel that im not learning as much in the\nclassroom so i have to spend time re-learning the same thing outside of class - and sometimes i understand the materials better. also\nthe exams are hand written, which is kinda a disconnect because in order to really know how to program, we need to practice it, aka\nactually do some programming instead of writing lines of code on paper and memorizing concepts"
 },
 {
   "LanguageCode": "en",
   "Text": "Nothing, everything that held me back from getting a better grade in this class was my fault."
 },
 {
   "LanguageCode": "en",
   "Text": "This class seems chaotic, it seems like the requirements for the semester-long project change constantly, which make it difficult on us.\nIt seems like everyone in the class is struggling to complete the project. The other parts of the class are fine, I just think this project needs to be rethought out"
 },
 {
   "LanguageCode": "en",
   "Text": "wouldnt change anything."
 },
 {
   "LanguageCode": "en",
   "Text": "I think this is a tough course to teach and the professor did as well as possible given the content. I think the course project was\nextremely challenging and the grading was unclear. The prompt would be ambiguous but there was clearly a rubric used to grade that\nwe did not have access to. It was hard to distinguish the expectations for each deliverable. The final deliverable with the APIs truly\ndidnt add value to the learning and took way more time investment than it is worth. There is valuable content in this course but it should\nbe taken into consideration the majority of students taking the course will not be developers. Understanding the code is necessary but\nthe APIs added no value and distracted from exam preparation."
 },
 {
   "LanguageCode": "en",
   "Text": "I would add more emphasis on assignments than exams."
 },
 {
   "LanguageCode": "en",
   "Text": "I just hope that professor Shafer finds a way to clone himself so he is able to do even more."
 },
 {
   "LanguageCode": "en",
   "Text": "Project needs to be reworked entirely. This is my second time taking this class and both times the project was an absolute nightmare.\nThe professor decided to provide us with templates most likely because he realized it was too hard and this ended up leading to things\nbeing very disorganized. The feedback after each deliverable was very vague and also pretty useless considering it would take so long\nto get it the next deliverable would already be due before getting any feedback on the last one. The exams in this class are another\nproblem. Memorizing the info needed to pass the exam in no way actually helps ones coding, without actually using a computer\nstudents are graded on 90pct memorization and 10pct actual coding capability."
 },
 {
   "LanguageCode": "en",
   "Text": "not much he can do, stuffs just hard"
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "Probably on what was most emphasized for exams. There is such a great deal of material that it feels unrealistic to expect students\nmaster the material enough to have to write in fill in the blanks without seeing an entire piece of code, especially for the last exam. At\nthe senior level students shouldnt feel like they might fail a class because they dont know what to expect for the exam."
 },
 {
   "LanguageCode": "en",
   "Text": "There were powerpoints that went over some concepts, but I didnt think they were super helpful. I think class time could be better\nutilized doing more hands on stuff, like the challenges, instead of just showing us what the code looks like."
 },
 {
   "LanguageCode": "en",
   "Text": "Project was stressful with amount of work"
 },
 {
   "LanguageCode": "en",
   "Text": "Nothing, I really like the class structure. Hands on exams were one of the highlights of the earlier coding class, and before I might have said that this class should have them too, but there is more background information in this class so I understand why written tests are\nmore appropriate."
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "need more office hours since most days there is a line and you wont be able to talk to him especially if projects are due soon. Also the\nproject was far too much work for 2 people and it was really hard to have to learn a lot of stuff outside of class for it. I think he should\nhelp us with the project more and guide us on how to work on it."
 },
 {
   "LanguageCode": "en",
   "Text": "I think the project and grade percentage breakdown should be changed. I think the project was a little over the top in expectations for\nwhat most students were capable of achieving. With very limited coding experience and only the challenges to help it was nearly\nimpossible to make the deliverables in the given timeframes and at the expected quality. We are not programmers, so I think we should\nplace an equal distribution of grade percentage on all the exams and projects, meaning everything should be worth 20pct."
 },
 {
   "LanguageCode": "en",
   "Text": "I would stop teaching PHP and instead replace it with C++ or Java. IMO web development is a dying industry as wordpress controls\n37pct of the internet. I think C++ and java would better prepare you for the future."
 },
 {
   "LanguageCode": "en",
   "Text": "Coding is tough"
 },
 {
   "LanguageCode": "en",
   "Text": "\nWe had an entire portion of the class taught by lynda videos, and were told towards the test that only a portion was going to be tested on"
 },
 {
   "LanguageCode": "en",
   "Text": "Wouldnt change anything."
 },
 {
   "LanguageCode": "en",
   "Text": "The course material sucked, CAPSIM was a complete waste of everyones time, my time would be put to much better use if I could\nchoose between a few classes to take"
 },
 {
   "LanguageCode": "en",
   "Text": "Can expand the application of the functions/coding in real world with real-life example (for example, google view, search engine)"
 },
 {
   "LanguageCode": "en",
   "Text": "I wish there were more in-class examples to work on rather than just watch what is happening and listen to lectures."
 },
 {
   "LanguageCode": "en",
   "Text": "I felt that most of the course content was a repeat of what I had already learned in a previous class. In addition, while I anticipate doing\nfine on the group project, I think that working in teams while coding leads to some logistical issues such as one team doing all the work.\nI do not think it test the individual competency of each team member."
 },
 {
   "LanguageCode": "en",
   "Text": "The atmosphere that this class is taught on is wrong. In computer science classes, less than half the class time in the computer lab.\nThey have 2 lectures and 1 lab because if properly taught, the programming will take no time to complete. Similarly, its impossible to\nremain in constant focus of what the professor is speaking when there is a computer with access to the world wide web in front of you.\nEveryone, and I really do mean everyone, got distracted at some point in the class and checked out other stuff in the web. The\ndiscipline needed to program is undermined by this atmosphere. As much as I hate to say it, Millennials spend so much time online that\nwe hold habits that will undermine our education if its held that way. The process should be simple: Study the code, understand it, then\nperform it. However, Professor Shafer is correct in having lectures on Tuesdays and implementations on Thursdays, but he loses half\nthe class in lectures because we can all get distracted by the giant monitors in front of us. This class needs to be moved to a small\nlecture hall on Tuesdays. Above all, professors cannot give students the ability to get distracted during their classes. Trust me, we will\nuse it"
 },
 {
   "LanguageCode": "en",
   "Text": "The only thing I would change would be to make parts of the project due during the semester. Even though students are supposed to\nbe on top of this, they are very busy and it is very easy to pass on this project during the weeks because the due date is at the end of\nthe semester. I feel like this would also help students prepare for the exams."
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "started to move very fast towards the end of the semester and it was hard to keep up with the project"
 },
 {
   "LanguageCode": "en",
   "Text": "I like the structure of the class. I particularly found it VERY helpful when we had time left over during the class to work on our projects and ask specific questions to the professor."
 },
 {
   "LanguageCode": "en",
   "Text": "Im not a fan of the format of the project + final exam. I would much rather prefer a multiple choice exam rather than a full coding exam since our other 2 exams were multiple choice related. The project should have deliverables due to keep people in check and doing the project rather than having it all due at the end of the semester."
 },
 {
   "LanguageCode": "en",
   "Text": "Nothing, I thought the course was taught very well. I was behind a lot but that was my fault and not the instructors."
 },
 {
   "LanguageCode": "en",
   "Text": "Give more quizzes based on the code. And make quizzes part of the grade. I would make project individual, because some people do\nnot participate in the project and thats why they dont do good on the exams."
 },
 {
   "LanguageCode": "en",
   "Text": "N/A (Class is changing next semester)"
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "Provide course materials and class captures to students, weeks before the start of the semester."
 },
 {
   "LanguageCode": "en",
   "Text": "Add more resources for coding help. He gave lynda videos and they helped me out a lot, more material like that would be great."
 },
 {
   "LanguageCode": "en",
   "Text": "Having more time to work on RentZen in class with professor and ITA assitance would have helped."
 },
 {
   "LanguageCode": "en",
   "Text": "I struggled a lot with this class and it moved so fast that I felt stupid and behind the entire time."
 },
 {
   "LanguageCode": "en",
   "Text": "This course was dense, lots of material. I wish we had more time to go over more security best practices. There was an issue with the\nmisdemo server that was fixed but caused some headacehes when trying to complete an assignment, this was eventually resolved. Im not sure the exams are effective. They felt like timed memorization exercises rather somehting that proves are coding abilites. I think\nthe project should have the option to be done individually without a partner. This course could be easily 100pct online, there really is no need to physically sit in the class room for this type of class. Shafer did a fantastic job he deserves a raise. He could put this course up on a udemy or edx.org and probably make some decent money. Similar courses are online at fraction of what Temple charges for this\nmaterial but you could reach tens of thousands of students or more. This course deserves a follow up course, diving deeper into web\napps."
 },
 {
   "LanguageCode": "en",
   "Text": "none"
 },
 {
   "LanguageCode": "en",
   "Text": "I liked how interactive the class was. Maybe encourage more participation."
 },
 {
   "LanguageCode": "en",
   "Text": "N/A"
 },
 {
   "LanguageCode": "en",
   "Text": "Building the SQL server from the ground up, as in creating a new dataanalytics.temple.edu"
 },
 {
   "LanguageCode": "en",
   "Text": "His lectures were a little wordy sometimes. It made it hard to understand or pay attention. His directions for assignments were also\nsometimes very unclear. I know that this was a pilot run on this course so it may of just been because of that."
 },
 {
   "LanguageCode": "en",
   "Text": "Providing slides showing correct homework code examples and how they related to talking points."
 },
 {
   "LanguageCode": "en",
   "Text": "a little more guidance with the assignments"
 },
 {
   "LanguageCode": "en",
   "Text": "the course?\nBreak down the aspect of writing code on the exam. Remembering to write a whole line of code is a very difficult task for students, who\nhad to transition over from PHP to JavaScript."
 },
 {
   "LanguageCode": "en",
   "Text": "Nothing :) Hes already trying his best for his students, and I believe everyone can see how hard he works!"
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "No comments."
 },
 {
   "LanguageCode": "en",
   "Text": "I would have a TA who took the class with the most recent curriculum, the one we had only took the class with PHP. Assignments and\nthings being pushed back early on in the semester really hurt us at the end for the project. More time between the project and the final\nwould be good so people have more time to prepare. Handwriting long chunks of code doesnt feel like the best way to test students,\nespecially because a lot of coding is typing it, running it and seeing what works, which we cant do on paper."
 },
 {
   "LanguageCode": "en",
   "Text": "Too much writing coding. Make exams on computer"
 },
 {
   "LanguageCode": "en",
   "Text": "TA (adam wolf) literally did not do anything. Sat on his phone during class when he should have been helping students, and let\nprofessor help students that were behind, which slowed down class and OFTEN resulted in professor not being able to finish lecture,\nand having to extend assignments or provide supplemental video. Also, we were the first section of the week and were often guinea\npigs and had tech malfunction, which is very frustrating because other sections were able to cover entirety of material. Also students\nneed to be able to code more independently, such as with pair coding in 3406, because you can only really learn by doing."
 },
 {
   "LanguageCode": "en",
   "Text": "Nothing, its fine the way it is."
 },
 {
   "LanguageCode": "en",
   "Text": "Just wish hed reply to his email"
 },
 {
   "LanguageCode": "en",
   "Text": "I would spend more time on JSON and Ajax before launching the students into a project that relies heavily upon them. Thats all!"
 },
 {
   "LanguageCode": "en",
   "Text": "On the exam, filling in coding aspects from three different coding files could be minimized a little and chosen from either 1-2 pages or fewer areas of each code."
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "Overall approach to the course. I think there is way to much information being drilled into our heads way too fast. I also would have\nliked if the professor would have assigned me a project partner when the project started, because he did not assign me one until we\nwere already 15 days in. I think the instructor understand the information he is talking about very well, but does a very poor job with\nexplaining it to student. I believe the class is made very hard and can be difficult to keep up with."
 },
 {
   "LanguageCode": "en",
   "Text": "n/a"
 },
 {
   "LanguageCode": "en",
   "Text": "not writing code by hand on the exams"
 },
 {
   "LanguageCode": "en",
   "Text": "I guess maybe give some more time for the class project and maybe make it a little harder to have more functionalities and a better\nuser experience/design."
 },
 {
   "LanguageCode": "en",
   "Text": "The structure of the exams does not match the structure and goals of the course. There is no applicable, real-world scenario where we\nwould need to hand write code."
 },
 {
   "LanguageCode": "en",
   "Text": "I wish the exams and assignments offered slightly more feedback and more leniency with grading. This is probably the hardest MIS\ncourse and I wish there was a policy which allowed us to make corrections to exams/ assignments after we got feedback on them, so\nwe could at least get half credit on them."
 },
 {
   "LanguageCode": "en",
   "Text": "n/a"
 },
 {
   "LanguageCode": "en",
   "Text": " Not much to say here.\nOnly thing I could think of is keeping the schedule the same for when you would be working on player/admin side for the project. It did confuse me when the first week\nyou would be working on admin in the morning and player in the afternoon, but then flipped it the next week."
 },
 {
   "LanguageCode": "en",
   "Text": " I would recommend the\ncourse be lightened that way we are able to focus on the most important concepts. Too much was thrown together causing confusion and not an effective learning\nenvironment."
 },
 {
   "LanguageCode": "en",
   "Text": " I felt the project was too\neasy. Professor Shafer walked us through majority of the project and left us with one task to do on our own. I think maybe students should be assigned more tasks to do\non our own?\n I think this will give students a better understanding of the concepts discussed in class."
 },
 {
   "LanguageCode": "en",
   "Text": " Tests can be nerve\nwracking wish there was more time between assignments and tests. It would be working on a hard assignment and then a test the next class wish there was a grace\nperiod."
 },
 {
   "LanguageCode": "en",
   "Text": " The coding should not be\nas challenging as it is. I have not once heard any of the other people in my class say they enjoyed this class. The coding classes within the MIS major are horrible."
 },
 {
   "LanguageCode": "en",
   "Text": " Maybe a bit more clear\non some aspects"
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": " N/A fantastic course!"
 },
 {
   "LanguageCode": "en",
   "Text": " The project worked\nhelped the most for me! So more of that!"
 },
 {
   "LanguageCode": "en",
   "Text": " One thing I will suggest\nis that sometimes the professor replies to email very slowly, sometimes even not."
 },
 {
   "LanguageCode": "en",
   "Text": " To maybe go a bit\nslower, not everyone is good at understanding the code at a fast pace. To also please try to answer back to emails, I would go more than a week to get a response back,\nand it did not help when I had important questions about specific assignments and the project."
 },
 {
   "LanguageCode": "en",
   "Text": " respond to emails better"
 },
 {
   "LanguageCode": "en",
   "Text": "N/A"
 },
 {
   "LanguageCode": "en",
   "Text": " Professor wasn't very\ngood at answering emails."
 },
 {
   "LanguageCode": "en",
   "Text": " I liked the course but I\nstill really feel confused about this project. Like I think I'm done but I still have no idea how my teammate plays a role in my project."
 },
 {
   "LanguageCode": "en",
   "Text": "N/A"
 },
 {
   "LanguageCode": "en",
   "Text": " I enjoyed Professor\nShafer's teaching style."
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "Nothing!"
 },
 {
   "LanguageCode": "en",
   "Text": ""
 },
 {
   "LanguageCode": "en",
   "Text": "Responding to emails.   \nHowever, I must add that he made himself very available for questions after class.\nand gave us multiple opportunities to attend office hours. In short, he was easily\naccessible even though he hardly responded to emails"
 },
 {
   "LanguageCode": "en",
   "Text": " Email communications"
 },
 {
   "LanguageCode": "en",
   "Text": " A little too much time\nwas spent answering questions about basic HTML, attributes, tags, JavaScript, and jQuery. Spend less time explaining ideas from prerequisite courses, do a more in-depth\nreview lesson and create a cheat-sheet instead."
 }
]